# NewRoom Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Document..::..NewRoom Method
Document Class See Also
---
Creates a new room.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NewRoom(Phase) | Creates a new unplaced room and with an assigned phase. |
| NewRoom(Level, UV) | Creates a new room on a level at a specified point. |
| NewRoom(Room, PlanCircuit) | Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit. |

# See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace